#ifndef __USART_H
#define __USART_H
#include "stdio.h"	
#include "sys.h" 


///////////////////////////////////////////////////////////	 
/*********************************************************/

//STM32F103   串口1初始化	

//STM32F103工程模板-库函数版本
//DevEBox  大越创新

//淘宝店铺：mcudev.taobao.com
//淘宝店铺：devebox.taobao.com	

/*********************************************************/
///////////////////////////////////////////////////////////	

#define USART_REC_LEN  		200  						//定义最大接收字节数 200
#define EN_USART1_RX 			1		  					//使能（1）/禁止（0）串口1接收
	  	
extern u8  USART_RX_BUF[USART_REC_LEN]; 	//接收缓冲,最大USART_REC_LEN个字节.末字节为换行符 
extern u16 USART_RX_STA;         					//接收状态标记	





void uart_init(u32 bound);  //串口1    初始化函数

#endif










///////////////////////////////////////////////////////////	 
/*********************************************************/
//STM32F103 开发板
	   
//STM32F103工程模板-库函数版本
//DevEBox  大越创新

//淘宝店铺：mcudev.taobao.com
//淘宝店铺：devebox.taobao.com	

/*********************************************************/
///////////////////////////////////////////////////////////	
