#ifndef __TIMER_H
#define __TIMER_H
#include "sys.h"

/******************************************************************************************/
//STM32F103 开发板

//ICAPTURE 输入捕获  驱动代码	 

//STM32F103工程模板-库函数版本
//DevEBox  大越创新

//淘宝店铺：mcudev.taobao.com
//淘宝店铺：devebox.taobao.com	

/****************************************************************************************/	


void TIM3_Int_Init(u16 arr,u16 psc);
void TIM3_PWM_Init(u16 arr,u16 psc);
void TIM2_Cap_Init(u16 arr,u16 psc);



#endif














/******************************************************************************************/
//STM32F103 开发板

//ICAPTURE 输入捕获  驱动代码	 

//STM32F103工程模板-库函数版本
//DevEBox  大越创新

//淘宝店铺：mcudev.taobao.com
//淘宝店铺：devebox.taobao.com	

/****************************************************************************************/	



